## Simple EDA on simple Covid19 data

In [1]:
# Import libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns; sns.set()

import bar_chart_race as bcr

In [2]:
#getdata
data = pd.read_csv('https://raw.githubusercontent.com/dexplo/bar_chart_race/master/data/covid19.csv')

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57 entries, 0 to 56
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            57 non-null     object
 1   Belgium         43 non-null     float64
 2   Brazil          37 non-null     float64
 3   Canada          45 non-null     float64
 4   China           57 non-null     float64
 5   France          57 non-null     float64
 6   Germany         45 non-null     float64
 7   India           43 non-null     float64
 8   Indonesia       43 non-null     float64
 9   Iran            57 non-null     float64
 10  Ireland         43 non-null     float64
 11  Italy           57 non-null     float64
 12  Mexico          35 non-null     float64
 13  Netherlands     48 non-null     float64
 14  Portugal        37 non-null     float64
 15  Spain           51 non-null     float64
 16  Sweden          43 non-null     float64
 17  Switzerland     49 non-null     float64
 18  Turkey          37 non-null     float64
 19  USA             54 non-null     float64
 20  United Kingdom  49 non-null     float64
dtypes: float64(20), object(1)
memory usage: 9.5+ KB

In [4]:
data.head()

,date,Belgium,Brazil,Canada,China,France,Germany,India,Indonesia,Iran,...,Italy,Mexico,Netherlands,Portugal,Spain,Sweden,Switzerland,Turkey,USA,United Kingdom
0,2020-02-26,NaN,NaN,NaN,2717.0,2.0,NaN,NaN,NaN,19.0,...,12.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2020-02-27,NaN,NaN,NaN,2746.0,2.0,NaN,NaN,NaN,26.0,...,17.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2020-02-28,NaN,NaN,NaN,2790.0,2.0,NaN,NaN,NaN,34.0,...,21.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2020-02-29,NaN,NaN,NaN,2837.0,2.0,NaN,NaN,NaN,43.0,...,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN
4,2020-03-01,NaN,NaN,NaN,2872.0,2.0,NaN,NaN,NaN,54.0,...,34.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN

- Os dados apresentam uma quantidade razoável de valores NA. Abaixo é detalhado essa quantidade.

In [5]:
dataNull = data.isnull().sum().sort_values(ascending=False); dataNull

Mexico            22
Turkey            20
Brazil            20
Portugal          20
Ireland           14
Indonesia         14
Belgium           14
Sweden            14
India             14
Canada            12
Germany           12
Netherlands        9
United Kingdom     8
Switzerland        8
Spain              6
USA                3
Iran               0
France             0
China              0
Italy              0
date               0
dtype: int64

- Observa-se que os únicos países que não apresentam valores NA são "Iran", "France", "China" e "Italy". Esses países serão utilizados para o exemplo bar_race.

In [6]:
data_p = data.dropna(axis=1) # excluindo as colunas com valores NA
data_p = data_p.set_index('date') # indexando o dataframe pela coluna "date"

In [7]:
data_p.head()

             China  France  Iran  Italy
date
2020-02-26  2717.0     2.0  19.0   12.0
2020-02-27  2746.0     2.0  26.0   17.0
2020-02-28  2790.0     2.0  34.0   21.0
2020-02-29  2837.0     2.0  43.0   29.0
2020-03-01  2872.0     2.0  54.0   34.0

In [8]:
data_p.info()

<class 'pandas.core.frame.DataFrame'>
Index: 57 entries, 2020-02-26 to 2020-04-22
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   China   57 non-null     float64
 1   France  57 non-null     float64
 2   Iran    57 non-null     float64
 3   Italy   57 non-null     float64
dtypes: float64(4)
memory usage: 2.2+ KB

In [11]:
bcr.bar_chart_race(df = data_p, title='b', filename='example_barRace.mp4')

/home/garcia/anaconda3/envs/my_notebooks01/lib/python3.7/site-packages/bar_chart_race/_make_chart.py:286: UserWarning: FixedFormatter should only be used together with FixedLocator
  ax.set_yticklabels(self.df_values.columns)
/home/garcia/anaconda3/envs/my_notebooks01/lib/python3.7/site-packages/bar_chart_race/_make_chart.py:287: UserWarning: FixedFormatter should only be used together with FixedLocator
  ax.set_xticklabels([max_val] * len(ax.get_xticks()))

## References

[1]https://raw.githubusercontent.com/dexplo/bar_chart_race/master/data/covid19.csv<br>
[2]https://github.com/dexplo/bar_chart_race<br>
[3]https://www.youtube.com/watch?v=qThD1InmsuI<br>
[4]https://stackoverflow.com/questions/13316397/matplotlib-animation-no-moviewriters-available<br>